# A/B Test Click-Through Rate Analysis

### Is the difference between this two click rates real or it have happened just by chance? 

$$
\begin{cases}
H_0: p_{con} = p_{exp} \\
H_1: p_{con} \ne p_{exp}
\end{cases}
$$

---

## Exploratory Data Analysis

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import norm

In [2]:
# Load the data
df = pd.read_csv('ab_test_data.csv')
df

       user_id  click group            timestamp
0            1      1   exp  2024-01-01 00:00:00
1            2      0   exp  2024-01-01 00:01:00
2            3      1   exp  2024-01-01 00:02:00
3            4      0   exp  2024-01-01 00:03:00
4            5      1   exp  2024-01-01 00:04:00
...        ...    ...   ...                  ...
19995    19996      1   con                  NaN
19996    19997      1   con                  NaN
19997    19998      1   con                  NaN
19998    19999      0   con                  NaN
19999    20000      1   con                  NaN

[20000 rows x 4 columns]

In [3]:
# Chaek the shape (row, column)
df.shape

(20000, 4)

In [4]:
# Check exactly where the missing values are and how much of them
df.isna().sum()

user_id          0
click            0
group            0
timestamp    10000
dtype: int64

In [5]:
# Details from numerical column
df.describe()

            user_id         click
count  20000.000000  20000.000000
mean   10000.500000      0.405250
std     5773.647028      0.490953
min        1.000000      0.000000
25%     5000.750000      0.000000
50%    10000.500000      0.000000
75%    15000.250000      1.000000
max    20000.000000      1.000000

In [6]:
# Check the columns
df.columns

Index(['user_id', 'click', 'group', 'timestamp'], dtype='object')

In [ ]:
# Clean the dataframe, dropping timestamp column
df.drop('timestamp', axis=1, inplace=True)
df

       user_id  click group
0            1      1   exp
1            2      0   exp
2            3      1   exp
3            4      0   exp
4            5      1   exp
...        ...    ...   ...
19995    19996      1   con
19996    19997      1   con
19997    19998      1   con
19998    19999      0   con
19999    20000      1   con

[20000 rows x 3 columns]

---

## Statistical Analysis